/**
 * 数字 \d
 */
const d = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
/**
 * 小写字母 [a-z]
 */
const l = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"]
/**
 * 大写字母 [A-Z]
 */
const u = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"]
/**
 * 标识符 \w...d,
 */
const w = ["_", ...l, ...u]
/**
 * [a-Z\d']
 */
const c = [...d, ...l, ...u]
module.exports = {
  d, l, u, w, c
}